Revit 2024 API
SpecTypeId.PipeSize Property
 Pipe Size, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipeSize { get; }
Visual Basic
Public Shared ReadOnly Property PipeSize As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipeSize {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace